chimarkhi/qtag-nrf-sdk12/nRF5_SDK_12.2.0_f012efa/examples/ble_peripheral/ble_app_temp_queuing/main.c
APP_TIMER_DEF(m_advdata_update_timer);
APP_TIMER_DEF(m_dataToDB_timer);
APP_TIMER_DEF(m_tstamp_timer);


/***@brief function for initializing nrf logging.
*/
void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function to get internal temperature of IC. Used for calibration */
uint32_t temperature_data_get(void)
{
    int32_t temp;
    uint32_t err_code;

    err_code = sd_temp_get(&temp);
    APP_ERROR_CHECK(err_code);

    temp = temp*25; // -200 for Minew_Tag16 and 07; -425 for Minew_tag13;
    int8_t exponent = -2;
    return ((exponent & 0xFF) << 24) | (temp & 0x00FFFFFF);
}


static void advdata_update(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    uint8_t       flags = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;
		uint16_t 			temp, humid_batt;
	
    ble_advdata_service_data_t service_data[1];
			
	
		#ifdef NRF51
			uint32_t temp_humid 	= 47;
			uint8_t batt_level 		= 74;
		#else 
			uint32_t temp_humid 	= get_temp_humid(&twi);
			uint8_t batt_level 		= get_battery_level();
		#endif
	  
		#ifdef CALIBRATION
			uint16_t temp_internal = (uint16_t)temperature_data_get();
		#endif
	
		if (temp_humid == I2C_READ_ERROR)
		{
			return;
		}
		else
		{
			temp					= (uint16_t)(temp_humid>>16);
			#ifdef CALIBRATION  // Internal temperature sent instead of humidity+battery 
				humid_batt  = temp_internal;
			#else
				humid_batt	= temp_humid<<8|batt_level;
			#endif
		}
		
		uint16_t timeStamp[2] = {(uint16_t)tstamp_sec,(uint16_t)(tstamp_sec>>16)};
		uint16_t recKey 	 		= get_recKey();
	
		uint16_t dataPacket[2*WORDLEN_DATAPACKET] = {APP_COMPANY_IDENTIFIER, recKey,
													 timeStamp[0], timeStamp[1],
													 temp,  			 humid_batt};	
	
		service_data[0].service_uuid = DATAPACKET_UUID;
    service_data[0].data.size    = 4*WORDLEN_DATAPACKET;
    service_data[0].data.p_data  = (uint8_t *) &dataPacket;



    // Build and set advertising data
    memset(&advdata, 0, sizeof(advdata));

//    ble_advdata_manuf_data_t manuf_specific_data;
//    manuf_specific_data.company_identifier = APP_COMPANY_IDENTIFIER;
//    manuf_specific_data.data.p_data = (uint8_t *)m_beacon_info;
//    manuf_specific_data.data.size   = APP_BEACON_INFO_LENGTH;

    advdata.include_appearance  		= false;
		advdata.name_type               = BLE_ADVDATA_SHORT_NAME;
		advdata.short_name_len					= 6;
//    advdata.p_manuf_specific_data 	= &manuf_specific_data;

    advdata.flags		         				= flags;
    advdata.service_data_count   		= 1;
    advdata.p_service_data_array 		= service_data;

    err_code = ble_advdata_set(&advdata, NULL);
    //NRF_LOG_DEBUG("adv set err: %d\r\n",err_code);
    APP_ERROR_CHECK(err_code);
		
}


void indicate_advertising(void)
{
		if (isAdvertising)
		{
			// Turn on LED to indicate advertising
			nrf_gpio_pin_write(19,1); // Minew S1 v1.0 green LED
			//nrf_gpio_pin_write(17,1); 	// Minew S1 v0.9 blue LED		
			//NRF_LOG_DEBUG("LED ON");
	
			nrf_delay_ms(5);
			// Turn off LED 
			nrf_gpio_pin_write(19,0); // Minew S1 v0.9 green LED
			//nrf_gpio_pin_write(17,0);		// Minew S1 v0.9 blue LED
			//NRF_LOG_DEBUG("LED OFF\r\n");
		}
}


void advdata_update_timer_timeout_handler(void * p_context)
{
	advdata_update();
	indicate_advertising();
}

void tstamp_timer_timeout_handler(void * p_context)
{
	 ++tstamp_sec;
//	NRF_LOG_DEBUG("Timestamp %d\r\n",tstamp_sec);
}

/**@brief Function for the tstamp and record key
 *
 * @details Initializes reckey and tstamp from last record key and timestamp stored in REC_KEY_LASTSEEN.
 * @details a check on read data's reckey is made, to see if it is within expected range. Otherwise tstamp 
 * @details and recCounter initialized to 0
 * @details Should be called only on device reset (battery change)
 */
void tstamp_reckey_init()
{
		uint32_t data[] 	= {0,0,0};
		uint16_t dataLen 	= sizeof(data);
		uint32_t err_code;
		err_code = fds_read(BACKUP_FILE_ID, REC_KEY_LASTSEEN, data, dataLen);
		if (err_code != NRF_SUCCESS) NRF_LOG_ERROR("FDS read error %d", err_code);
		
		if ((data[0] <=  (uint32_t)0xFFFF) 			& 
			  (data[0] >= (uint32_t)REC_KEY_START ) 	&
				err_code == FDS_SUCCESS	)
		{
			tstamp_sec = data[1]+1;
			recCounter_init((uint16_t)data[0]+1);
		}
		else
		{
			tstamp_sec = 0;
			recCounter_init(REC_KEY_START);
		}
		
		NRF_LOG_INFO("Starting from RECKEY,tstamp: [%04x,%08x]\r\n",(uint16_t)data[0],tstamp_sec);
}


void dataToDB_timer_timeout_handler(void * p_context)
{
		time_t date_hour_seconds = tstamp_sec;
		uint16_t temp, humid_batt;
		
		
		uint32_t temp_humid		= get_temp_humid(&twi);
		uint8_t batt_level		= get_battery_level();

		#ifdef CALIBRATION
			uint16_t temp_internal = (uint16_t)temperature_data_get();
		#endif
	
		if (temp_humid == I2C_READ_ERROR)
		{	
			return;
		}
		else
		{
			temp				= (uint16_t)(temp_humid>>16);
			#ifdef CALIBRATION  // Internal temperature sent instead of humidity+battery 
				humid_batt  = temp_internal;
			#else
				humid_batt	= temp_humid<<8 | batt_level;
			#endif
		}
		
		uint32_t timeStamp = date_hour_seconds;
		uint32_t recKey = get_recKey();
		
		uint32_t dataPacket[WORDLEN_DATAPACKET] = {recKey,
														 timeStamp,
														 (temp << 16) | humid_batt};	
		NRF_LOG_RAW_INFO("\r\n\n\n");
		NRF_LOG_DEBUG("Data to DB: RecKey %08x, time %08x, data %08x\r\n", dataPacket[0], dataPacket[1], dataPacket[2]);
		uint32_t err_code = dataToDB(FILE_ID, recKey, dataPacket, WORDLEN_DATAPACKET);
		// if data saved successfully, update the last seen reckey and tstamp in flash												 

		if (err_code == NRF_SUCCESS) 
		{
//			wait_for_fds_evt(FDS_EVT_WRITE);
			err_code = fds_find_and_delete(BACKUP_FILE_ID, REC_KEY_LASTSEEN);
			err_code = fds_write(BACKUP_FILE_ID, REC_KEY_LASTSEEN, dataPacket, WORDLEN_DATAPACKET);
		}
		else	NRF_LOG_ERROR("DataToDB error : %d", err_code); 
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);

    uint32_t err_code = app_timer_create(&m_advdata_update_timer, APP_TIMER_MODE_REPEATED, advdata_update_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);
	
