chimarkhi/qtag-nrf-sdk12/nRF5_SDK_12.2.0_f012efa/examples/ble_peripheral/ble_app_temp_queuing/main.c
    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}



/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    uint8_t       flags = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;

    ble_advdata_manuf_data_t manuf_specific_data;

    manuf_specific_data.company_identifier = APP_COMPANY_IDENTIFIER;

    manuf_specific_data.data.p_data = (uint8_t *) m_beacon_info;
    manuf_specific_data.data.size   = APP_BEACON_INFO_LENGTH;

    // Build and set advertising data.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type             = BLE_ADVDATA_NO_NAME;
    advdata.flags                 = flags;
    advdata.p_manuf_specific_data = &manuf_specific_data;
		
    err_code = ble_advdata_set(&advdata, NULL);
		APP_ERROR_CHECK(err_code);
		
    // Initialize advertising parameters (used when starting advertising).
    memset(&m_adv_params, 0, sizeof(m_adv_params));

//		uint8_t adv_mult 				 = ble_tbs_get_advinterval(&m_tbs);
//		uint16_t adv_interval		 = MSEC_TO_UNITS(adv_mult*ADV_INTERVAL_UNIT_IN_MS, UNIT_0_625_MS);
		
    m_adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
		m_adv_params.p_peer_addr = NULL;                             // Undirected advertisement.
    m_adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    m_adv_params.interval    = ADV_INTERVAL;
    m_adv_params.timeout     = APP_CFG_NON_CONN_ADV_TIMEOUT;
}


/**@brief Function for starting advertising.
 */
static uint32_t advertising_start(void)
{
    uint32_t err_code =  NRF_SUCCESS;

    err_code = sd_ble_gap_adv_start(&m_adv_params);
		if (err_code == NRF_SUCCESS)
		{
			isAdvertising = true;
			NRF_LOG_INFO("Advertising started");
		}
		return err_code;
}

/**@brief Function for stopping advertising.
 */
static uint32_t advertising_stop(void)
{
    uint32_t err_code;
		if(isAdvertising)
		{
			err_code = sd_ble_gap_adv_stop();
		}
		else NRF_LOG_WARNING("/r/n/nAdv stop called, but already not advertising/r/n/n");
		
		if (err_code == NRF_SUCCESS) 
		{
			isAdvertising = false;
			NRF_LOG_INFO("Advertising stopped");	
		}
		return err_code;
}



/**@brief Function for the application's SoftDevice event handler.
 *
 * @param[in] p_ble_evt SoftDevice event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code;
		uint8_t nus_status;
	
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
						isAdvertising = false;
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
						nrf_gpio_pin_write(18,1);				// Minew S1 v1.0 Red LED
						//nrf_gpio_pin_write(18,1);			// Minew S1 v0.9 Red LED	
						break; // BLE_GAP_EVT_CONNECTED

				case BLE_EVT_TX_COMPLETE:
            // Send next key event						
						NRF_LOG_INFO("\r\nTX Complete\r\n");
            //nus_tx_flag_set();
						nusRecKey++;
						nus_status = check_nusRecKey(nusRecKey, nusCurrentKey);
						if(nus_status == NUS_CONTINUE) payload_to_central_async(&m_nus, nusRecKey);
						else if (nus_status == NUS_STOP)
						{
							err_code = nus_eom_send(&m_nus, NUS_MSGTYPE_EOM);
								if (err_code != NRF_SUCCESS) { 
									NRF_LOG_ERROR("Err sending eom package: %d\r\n", err_code);
								}
								else NRF_LOG_INFO("EOM sent \r\n");
						}
						break; // BLE_EVT_TX_COMPLETE
				
        case BLE_GAP_EVT_DISCONNECTED:
            nrf_gpio_pin_write(18,0);				// Minew S1 v1.0 Red LED
            //nrf_gpio_pin_write(18,0);			// Minew S1 v0.9 Red LED
						syncType = SYNCTYPE_STRAIGHT;
						err_code = advertising_start();
						if (err_code !=NRF_SUCCESS) 
						{
							NRF_LOG_ERROR("Adv restart failed after disconnet errcode: %d\r\n",err_code);						
						}
						else  NRF_LOG_INFO("Adv restarted after disconnect\r\n\n"); 
						m_conn_handle = BLE_CONN_HANDLE_INVALID;
						break; // BLE_GAP_EVT_DISCONNECTED

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GAP_EVT_SEC_PARAMS_REQUEST

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_SYS_ATTR_MISSING

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTC_EVT_TIMEOUT

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_TIMEOUT

        case BLE_EVT_USER_MEM_REQUEST:
            err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gattc_evt.conn_handle, NULL);
            APP_ERROR_CHECK(err_code);
            break; // BLE_EVT_USER_MEM_REQUEST

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
        {
            ble_gatts_evt_rw_authorize_request_t  req;
            ble_gatts_rw_authorize_reply_params_t auth_reply;

            req = p_ble_evt->evt.gatts_evt.params.authorize_request;

            if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
            {
                if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
                {
                    if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                    }
                    else
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                    }
                    auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                    APP_ERROR_CHECK(err_code);
                }
            }
        } break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

