chimarkhi/qtag-nrf-sdk12/nRF5_SDK_12.2.0_f012efa/examples/ble_peripheral/ble_app_temp_queuing/main.c
		#ifdef INIT_DEVICE

		NRF_LOG_INFO("\r\n\n----Device Flash Init Begin----\n");
		
		err_code = fds_file_delete(FILE_ID);
		NRF_LOG_ERROR("file del err: %d \n",err_code);
		APP_ERROR_CHECK(err_code);				
		NRF_LOG_RAW_INFO("\r\n\n");
		// Wait for GC to complete on FILE
		wait_for_fds_evt(FDS_EVT_GC);
		
		err_code = fds_file_delete(BACKUP_FILE_ID);
		NRF_LOG_ERROR("file del err: %d \n",err_code);
		APP_ERROR_CHECK(err_code);				
		NRF_LOG_RAW_INFO("\r\n\n");
		// Wait for GC to complete on FILE
		wait_for_fds_evt(FDS_EVT_GC);
		

		NRF_LOG_INFO("Writing data to LASTSEEN record:\r\n");
		uint32_t testData[] = {(uint32_t)REC_KEY_START,0x00000000,0x00000000};
		err_code = fds_write(BACKUP_FILE_ID, REC_KEY_LASTSEEN, testData, 3);
		APP_ERROR_CHECK(err_code);
		// Wait for write done event
		wait_for_fds_evt(FDS_EVT_WRITE);
		
		NRF_LOG_RAW_INFO("----Device Flash Init Done----\r\n\n\n");
		#endif

		#ifdef CALIBRATION
		nrf_delay_ms(1000);
		NRF_LOG_RAW_INFO("\r\n\n\n----THIS IS A CALIBRATION DEVICE ----\r\n\n\n");
		#endif
		
		nrf_delay_ms(1000);
		
		tstamp_reckey_init();		

		// Start execution.
		nrf_delay_ms(1000);
		timers_start();
		NRF_LOG_INFO("Times Start.. \n");

		err_code = advertising_start();
		NRF_LOG_INFO("adv start err: %d \n",err_code);
		APP_ERROR_CHECK(err_code);
		NRF_LOG_INFO("Started Advertising \n");
		
		bsp_board_leds_on();
		

    // Enter main loop.
    for (;; )
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */